### Juan Miguel Torres Gómez

In [1]:
import pandas as pd
import numpy as np

In [5]:
from datetime import datetime
df = pd.DataFrame({'nombres':('Juan Pérez',
                                 'María Sánchez'
                                 , 'Jorge Vargas',
                                 'Rodrigo Martínez'),
            'fechas':(datetime(1995,12,21), 
                      datetime(1989,1,13), 
                      datetime(1992,9,14), 
                      datetime(1993,7,8)),
            'saldo': (2500, 
                      5345, 
                      np.NaN, 
                      11323.2),
            'al_corriente':(True, 
                            True, 
                            False, 
                            True)})
df

            nombres     fechas    saldo  al_corriente
0        Juan Pérez 1995-12-21   2500.0          True
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [8]:
#Operador .iloc, trae el rango o fila que vamos a utilizar por posicion o indices
#data.iloc(<filas>,<columnas>)
print(type(df.iloc[0]))
df.iloc[0]

<class 'pandas.core.series.Series'>

nombres                  Juan Pérez
fechas          1995-12-21 00:00:00
saldo                        2500.0
al_corriente                   True
Name: 0, dtype: object

In [10]:
df.iloc[1]

nombres               María Sánchez
fechas          1989-01-13 00:00:00
saldo                        5345.0
al_corriente                   True
Name: 1, dtype: object

In [12]:
df.iloc[-1] #ultima fila

nombres            Rodrigo Martínez
fechas          1993-07-08 00:00:00
saldo                       11323.2
al_corriente                   True
Name: 3, dtype: object

In [15]:
df.iloc[:,0] #Primer columna

0          Juan Pérez
1       María Sánchez
2        Jorge Vargas
3    Rodrigo Martínez
Name: nombres, dtype: object

In [23]:
df.iloc[:,1] #Segunda columna

0   1995-12-21
1   1989-01-13
2   1992-09-14
3   1993-07-08
Name: fechas, dtype: datetime64[ns]

In [19]:
df.iloc[:,-1] #Ultima columna

0     True
1     True
2    False
3     True
Name: al_corriente, dtype: bool

In [26]:
df.iloc[1:3]#Rango de filas

         nombres     fechas   saldo  al_corriente
1  María Sánchez 1989-01-13  5345.0          True
2   Jorge Vargas 1992-09-14     NaN         False

In [28]:
df.iloc[0:3:2]#Rango de filas

        nombres     fechas   saldo  al_corriente
0    Juan Pérez 1995-12-21  2500.0          True
2  Jorge Vargas 1992-09-14     NaN         False

In [30]:
df.iloc[:,1:3]#Rango de columnas

      fechas    saldo
0 1995-12-21   2500.0
1 1989-01-13   5345.0
2 1992-09-14      NaN
3 1993-07-08  11323.2

In [33]:
df.iloc[[1,3,0]]#Lista de filas

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
3  Rodrigo Martínez 1993-07-08  11323.2          True
0        Juan Pérez 1995-12-21   2500.0          True

In [34]:
df.iloc[:,[1,3,0]]#Lista de columnas

      fechas  al_corriente           nombres
0 1995-12-21          True        Juan Pérez
1 1989-01-13          True     María Sánchez
2 1992-09-14         False      Jorge Vargas
3 1993-07-08          True  Rodrigo Martínez

In [37]:
df.iloc[[1,3,0],[1,3,0]]#Lista de filas y columnas

      fechas  al_corriente           nombres
1 1989-01-13          True     María Sánchez
3 1993-07-08          True  Rodrigo Martínez
0 1995-12-21          True        Juan Pérez

In [39]:
df.iloc[1,[1,3,0]]#Lista de fila 1 y columnas

fechas          1989-01-13 00:00:00
al_corriente                   True
nombres               María Sánchez
Name: 1, dtype: object

In [41]:
df.iloc[1,:]#Lista de filas y columnas

nombres               María Sánchez
fechas          1989-01-13 00:00:00
saldo                        5345.0
al_corriente                   True
Name: 1, dtype: object

### !  .iloc no trabaja con etiquetas !

### !  .loc recupera filas y columnas por etiquetas !

In [43]:
df.loc[1:3]

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [46]:
df.loc[:,"saldo"]#Una columna

0     2500.0
1     5345.0
2        NaN
3    11323.2
Name: saldo, dtype: float64

In [51]:
df.loc[:,"saldo":"al_corriente"]#rango de columnas

     saldo  al_corriente
0   2500.0          True
1   5345.0          True
2      NaN         False
3  11323.2          True

#### Las etiquetas tienen que estar en orden, de lo contrario no se 
#### recupera nada

In [52]:
df.loc[:,"fechas":"saldo"]#rango de columnas

      fechas    saldo
0 1995-12-21   2500.0
1 1989-01-13   5345.0
2 1992-09-14      NaN
3 1993-07-08  11323.2

In [54]:
#En este caso especificamos las etiquetas y no como rangos
df.loc[:,["fechas","saldo","nombres"]]#rango de columnas

      fechas    saldo           nombres
0 1995-12-21   2500.0        Juan Pérez
1 1989-01-13   5345.0     María Sánchez
2 1992-09-14      NaN      Jorge Vargas
3 1993-07-08  11323.2  Rodrigo Martínez

In [57]:
df.loc[1,["fechas","saldo","nombres"]]#rango de columnas

fechas     1989-01-13 00:00:00
saldo                   5345.0
nombres          María Sánchez
Name: 1, dtype: object

In [73]:
df.loc[[1,3,2],["fechas","saldo","nombres"]]#rango de columnas

      fechas    saldo           nombres
1 1989-01-13   5345.0     María Sánchez
3 1993-07-08  11323.2  Rodrigo Martínez
2 1992-09-14      NaN      Jorge Vargas

In [75]:
print(df.loc[1:3])
print("-----------".center(60,'*'))
print(df.iloc[1:3])

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True
************************-----------*************************
         nombres     fechas   saldo  al_corriente
1  María Sánchez 1989-01-13  5345.0          True
2   Jorge Vargas 1992-09-14     NaN         False

In [78]:
df_iloc = df.iloc[1:3]
df_iloc

         nombres     fechas   saldo  al_corriente
1  María Sánchez 1989-01-13  5345.0          True
2   Jorge Vargas 1992-09-14     NaN         False

In [83]:
print(df_iloc.loc[1])
print("-----------".center(60,'*'))
print(df_iloc.iloc[1])

nombres               María Sánchez
fechas          1989-01-13 00:00:00
saldo                        5345.0
al_corriente                   True
Name: 1, dtype: object
************************-----------*************************
nombres                Jorge Vargas
fechas          1992-09-14 00:00:00
saldo                           NaN
al_corriente                  False
Name: 2, dtype: object

In [87]:
df

            nombres     fechas    saldo  al_corriente
0        Juan Pérez 1995-12-21   2500.0          True
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [86]:
df["saldo"] > 3000

0    False
1     True
2    False
3     True
Name: saldo, dtype: bool

In [90]:
df.loc[df["saldo"] > 3000, ["nombres","saldo"]]

            nombres    saldo
1     María Sánchez   5345.0
3  Rodrigo Martínez  11323.2

In [92]:
ss3 = df["saldo"] > 3000
print(type(ss3))
ss3

<class 'pandas.core.series.Series'>

0    False
1     True
2    False
3     True
Name: saldo, dtype: bool

In [97]:
# ~ es un NOT
df.loc[~ss3] #clientes con un saldo no mayor a 3000

        nombres     fechas   saldo  al_corriente
0    Juan Pérez 1995-12-21  2500.0          True
2  Jorge Vargas 1992-09-14     NaN         False

In [99]:
df.loc[ss3] #clientes con un saldo mayor a 3000

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [101]:
#CUANDO SE SELECCIONA SOLO UNA COLUMAN SE VUELVE UNA SERIE
df.loc[df["al_corriente"]]

            nombres     fechas    saldo  al_corriente
0        Juan Pérez 1995-12-21   2500.0          True
1     María Sánchez 1989-01-13   5345.0          True
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [104]:
df.loc[df["al_corriente"],"nombres":"saldo"]

            nombres     fechas    saldo
0        Juan Pérez 1995-12-21   2500.0
1     María Sánchez 1989-01-13   5345.0
3  Rodrigo Martínez 1993-07-08  11323.2

In [110]:
#VISUALIZAR EL NÚMERO DE DATOS FALTANRES DEL DF
df_null = df.isnull()
df_null

   nombres  fechas  saldo  al_corriente
0    False   False  False         False
1    False   False  False         False
2    False   False   True         False
3    False   False  False         False

In [114]:
#VISUALIZAR EL NÚMERO DE DATOS FALTANTES POR COLUMNA
df.isnull().sum()

nombres         0
fechas          0
saldo           1
al_corriente    0
dtype: int64

In [116]:
#VISUALIZAR EL NÚMERO DE DATOS FALTANTES POR TOTAL
df.isnull().sum().sum()

1

In [121]:
print(type(df.isnull().values))
df.isnull().values

<class 'numpy.ndarray'>

array([[False, False, False, False],
       [False, False, False, False],
       [False, False,  True, False],
       [False, False, False, False]])

In [123]:
#VERIFICAMOS SI POR LO MENOS HAY UN VALOR NULO
df.isnull().values.any()

True

In [126]:
df.isnull().any()
print(type(df.isnull().any()))

<class 'pandas.core.series.Series'>

In [136]:
df[df.isnull().any(1)]

        nombres     fechas  saldo  al_corriente
2  Jorge Vargas 1992-09-14    NaN         False